Revit 2027 API
UV.CrossProduct Method
The cross product of this 2-D vector and the specified 2-D vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CrossProduct(
	UV source
)
Public Function CrossProduct (
	source As UV
) As Double
public:
double CrossProduct(
	UV^ source
)
member CrossProduct :
        source : UV -> float
Parameters
source UV
The vector to multiply with this vector.
Return Value
Double
The real number equal to the cross product.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when source is null.
Remarks
 The cross product of the two vectors in 2-D space is equivalent to the area of the parallelogram they span.
See Also
Reference
UV Class
Autodesk.Revit.DB Namespace